package java常用类;

public class java快捷键 {

}
/**
 * 1. 【ALT+/】 
 * 此快捷键为用户编辑的好帮手，能为用户提供内容的辅助，不要为记不全方法和属性名称犯愁，当记不
 * 全类、方法和属性的名字时，多体验一下【ALT+/】快捷键带来的好处吧。
 * 2. 【Ctrl+/】
 * 快速添加注释，能为光标所在行或所选定行快速添加注释或取消注释，在调试的时候可能总会需要注释
 * 一些东西或取消注释，现在好了，不需要每行进行重复的注释。
 * 3. 【Ctrl+D】
 * 删除当前行，这也是笔者的最爱之一，不用为删除一行而按那么多次的删除键。
 * 4. 【Alt+↓】、【Alt+↑】
 * 当前行和下面一行交互位置、当前行和上面一行交互位置(特别实用,可以省去先剪切,再粘贴了)
 *  5. 【Ctrl+M】
 *  窗口最大化和还原，用户在窗口中进行操作时，总会觉得当前窗口小（尤其在编写代码时），现在好了，
 *  试试【Ctrl+M】快捷键。
 *  
 *  
 *  1. 【Ctrl+Shift+T】
 *  查找工作空间（Workspace）构建路径中的可找到Java类文件，不要为找不到类而痛苦，而且可以使用“*”、“？”等通配符。
 *  
 *
 * 
 * 
 */
